# -*- eval: (setq-local default-directory "~/gqlgen-todos"); -*-
# -*- eval: (setq-local compile-command "go run server/server.go"; -*-
# -*- github-username: "hh"; -*-
# -*- compile-command: "go run server/server.go"; -*-

** errors
locally: [[file:resolver.go::17][resolver.go::17]]

#+BEGIN_EXAMPLE
./resolver.go:17:24: cannot use &queryResolver literal (type *queryResolver) as type QueryResolver in return argument:
	*queryResolver does not implement QueryResolver (wrong type for Todos method)
		have Todos(context.Context) ([]Todo, error)
		want Todos(context.Context) ([]*Todo, error)

Compilation exited abnormally with code 2 at Sun May 19 06:47:30
#+END_EXAMPLE

The following block can be use to stop the server and bring in the logs:

#+BEGIN_SRC elisp
(with-current-buffer (get-buffer "*compilation*")
(buffer-substring 0 5)
)
#+END_SRC

#+BEGIN_SRC shell
pkill -P $(pgrep -f server/server.go)
#+END_SRC

#+RESULTS:
#+BEGIN_EXAMPLE
#+END_EXAMPLE

#+BEGIN_SRC shell :async
(
go run server/server.go
) 2>&1
echo $?
#+END_SRC

#+RESULTS:
#+BEGIN_EXAMPLE
# github.com/hh/gqlgen-todos
./resolver.go:17:24: cannot use &queryResolver literal (type *queryResolver) as type QueryResolver in return argument:
	,*queryResolver does not implement QueryResolver (wrong type for Todos method)
		have Todos(context.Context) ([]Todo, error)
		want Todos(context.Context) ([]*Todo, error)
2
#+END_EXAMPLE

then open http://localhost:8080 in a browser. here are some queries to try:
 
TODO: Skewer and org mode might be very interesting at this point.
Mainly for populating that left query side.

#+BEGIN_SRC elisp
(setq-local compile-command "go run server/server.go ")
#+END_SRC
